etsydemo/app/controllers/listings_controller.rb

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "AS"], ["description", "a"], ["price", 0.1], ["user_id", 3], ["created_at", "2016-05-03 18:10:22.107489"], ["updated_at", "2016-05-03 18:10:22.107489"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_size" = ?, "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["image_file_size", 3123], ["image_updated_at", "2016-04-24 17:49:35.020414"], ["image_file_name", "pear.jpeg"], ["updated_at", "2016-04-24 17:49:35.127249"], ["id", 8]]

  def seller
    @listings = Listing.where(user_id: current_user.id)
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 3]]