etsydemo/app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    respond_to do |format|
      if @order.save
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 18]]
INSERT INTO "orders" ("address", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "123 main street"], ["city", "New York"], ["state", "NY"], ["created_at", "2016-05-04 10:19:17.110262"], ["updated_at", "2016-05-04 10:19:17.110262"]]

  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 1  ORDER BY created_at DESC